In [1]:
# loading, cleaning, transforming, and rearranging

In [2]:
import numpy as np
import pandas as pd

# 7.1 Handling Missing Data

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
# .isnull()

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [9]:
string_data   # None == NaN

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
# .notnull()

In [12]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [15]:
string_data.fillna("Sinko") #inplace = False

0        Sinko
1    artichoke
2        Sinko
3      avocado
dtype: object

In [14]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

## Filtering Out Missing Data

In [16]:
data = pd.Series([1,np.nan,3.5,np.nan,7])

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
#or
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
data.dropna(how = "all") #if all index is NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7,3))

In [26]:
df

          0         1         2
0  0.060301 -0.308881  0.043876
1  0.228019 -1.758879  1.034836
2 -0.176155  0.942389 -1.148935
3 -0.945634  0.071406 -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

In [27]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan

In [28]:
df

          0         1         2
0  0.060301       NaN       NaN
1  0.228019       NaN       NaN
2 -0.176155       NaN -1.148935
3 -0.945634       NaN -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

In [ ]:
#thresh=...

In [40]:
df.dropna(thresh = 2)

          0         1         2
2 -0.176155       NaN -1.148935
3 -0.945634       NaN -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

In [35]:
df

          0         1         2
0  0.060301       NaN       NaN
1  0.228019       NaN       NaN
2 -0.176155       NaN -1.148935
3 -0.945634       NaN -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

## Filling In Missing Data

In [53]:
df

          0         1         2
0  0.060301       NaN       NaN
1  0.228019       NaN       NaN
2 -0.176155       NaN -1.148935
3 -0.945634       NaN -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

In [55]:
df.fillna(0).head()

          0         1         2
0  0.060301  0.000000  0.000000
1  0.228019  0.000000  0.000000
2 -0.176155  0.000000 -1.148935
3 -0.945634  0.000000 -0.240922
4  1.100238  0.188006  0.679365

In [57]:
df.fillna({1:0.5,2:0})  # Dict choose column and value

          0         1         2
0  0.060301  0.500000  0.000000
1  0.228019  0.500000  0.000000
2 -0.176155  0.500000 -1.148935
3 -0.945634  0.500000 -0.240922
4  1.100238  0.188006  0.679365
5 -0.253172  0.846962 -0.214186
6 -1.331210 -0.619871 -1.162399

In [58]:
df = pd.DataFrame(np.random.randn(6,3))

In [64]:
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan

In [65]:
df

          0         1         2
0 -1.661886  1.353933 -0.434189
1  0.224580  2.169545 -0.511070
2 -0.889791       NaN  0.047226
3 -0.750165       NaN  1.481311
4 -1.850592       NaN       NaN
5 -0.715662       NaN       NaN

In [67]:
#fillna(method = "ffill")

In [66]:
df.fillna(method = "ffill")

          0         1         2
0 -1.661886  1.353933 -0.434189
1  0.224580  2.169545 -0.511070
2 -0.889791  2.169545  0.047226
3 -0.750165  2.169545  1.481311
4 -1.850592  2.169545  1.481311
5 -0.715662  2.169545  1.481311

In [69]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

## Removing Duplicates

In [70]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [71]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [76]:
#.duplicated()

In [75]:
data.duplicated() # observe duplicating rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [78]:
#.drop_duplicates()

In [81]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Transforming Data Using a Function or Mapping

In [82]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [83]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [84]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [88]:
#! perfect question

In [86]:
data["animal"] = data["food"].str.lower().map(meat_to_animal)

In [87]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [89]:
data.drop("animal",axis=1,inplace=True)

In [90]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [91]:
#Other ways

In [92]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [93]:
#So
data["animal"] = data["food"].map(lambda x: meat_to_animal[x.lower()])

In [94]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Replacing Values

In [95]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [96]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [97]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [99]:
data #inplace=False

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [100]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [101]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [102]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [103]:
transform = lambda x : x[:4].upper()

In [105]:
data.index = data.index.map(transform)

In [106]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### .rename()

In [108]:
data.rename(index = {"OHIO":"INDIANA"},
           columns = {"three":3})

         one  two   3  four
INDIANA    0    1   2     3
COLO       4    5   6     7
NEW        8    9  10    11

In [109]:
#inplace

## Discretization and Binning

In [110]:
# Read later

## Detecting and Filtering Outliers

In [111]:
data = pd.DataFrame(np.random.randn(1000,4))

In [112]:
data

            0         1         2         3
0   -0.221122 -1.874573 -1.306100  0.227793
1   -0.994781 -0.683981 -0.725303 -1.625408
2   -1.447527 -0.372721 -1.167411 -1.124231
3    0.971731 -0.955060 -0.590159 -1.632949
4   -1.230083  1.190977  0.755990 -2.406604
..        ...       ...       ...       ...
995 -0.442787 -0.564556  0.188001  1.713923
996 -0.592411  0.092231  0.079179 -0.587897
997 -1.326330  0.058274  2.375814  2.573394
998  2.100271 -0.822103  1.309508 -0.934042
999 -1.486813  0.027140  0.060170  0.572795

[1000 rows x 4 columns]

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.034935    -0.005174     0.008790    -0.001550
std       0.967878     0.970513     0.990127     0.939943
min      -2.763869    -2.983336    -2.894105    -2.914016
25%      -0.678468    -0.664586    -0.687469    -0.663955
50%      -0.077556     0.000349     0.075847    -0.015156
75%       0.587409     0.657532     0.656382     0.596479
max       2.819076     3.329196     2.923514     3.094108

In [115]:
col = data[2]

In [116]:
col

0     -1.306100
1     -0.725303
2     -1.167411
3     -0.590159
4      0.755990
         ...
995    0.188001
996    0.079179
997    2.375814
998    1.309508
999    0.060170
Name: 2, Length: 1000, dtype: float64

In [118]:
col[col.abs() > 2]

13     2.215697
50     2.487245
71     2.100036
73    -2.099833
108   -2.560871
169    2.213751
170   -2.372306
172    2.147560
207   -2.120435
210    2.414652
213    2.534808
214    2.053207
226    2.372626
241   -2.058918
263   -2.257798
459    2.310172
523   -2.230710
545   -2.080964
584    2.036393
595   -2.062469
597    2.779065
601    2.149417
606   -2.067629
607   -2.894105
639   -2.060634
706   -2.239066
735   -2.463568
755    2.923514
762    2.303168
768   -2.061394
776   -2.155259
804   -2.075596
808    2.640327
809    2.418603
823   -2.085436
847    2.773110
870    2.697945
887    2.836932
997    2.375814
Name: 2, dtype: float64

In [121]:
data[np.abs(data) > 2]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [119]:
data[np.abs(data) > 2] = np.sign(data) * 2

In [120]:
data

            0         1         2         3
0   -0.221122 -1.874573 -1.306100  0.227793
1   -0.994781 -0.683981 -0.725303 -1.625408
2   -1.447527 -0.372721 -1.167411 -1.124231
3    0.971731 -0.955060 -0.590159 -1.632949
4   -1.230083  1.190977  0.755990 -2.000000
..        ...       ...       ...       ...
995 -0.442787 -0.564556  0.188001  1.713923
996 -0.592411  0.092231  0.079179 -0.587897
997 -1.326330  0.058274  2.000000  2.000000
998  2.000000 -0.822103  1.309508 -0.934042
999 -1.486813  0.027140  0.060170  0.572795

[1000 rows x 4 columns]

In [122]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [123]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [125]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

## .permutation()

In [124]:
sampler = np.random.permutation(5)

In [126]:
sampler

array([0, 4, 3, 1, 2])

## .take()

In [127]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

### More Easily

In [128]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

### Computing Indicator/Dummy Variables

In [130]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})

In [131]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [132]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0